; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 814109 2 3 3 3 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	spectrograph1 - mode
	thermograph2 - mode
	infrared0 - mode
	Star2 - direction
	Star1 - direction
	GroundStation0 - direction
	Planet3 - direction
	Star4 - direction
	Planet5 - direction
	Star6 - direction
	Planet7 - direction
	Planet8 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star2)
	(supports instrument1 spectrograph1)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 infrared0)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet3)
	(supports instrument3 thermograph2)
	(supports instrument3 infrared0)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
)
(:goal (and
	(pointing satellite0 Planet5)
	(have_image Planet3 spectrograph1)
	(have_image Star4 spectrograph1)
	(have_image Planet5 thermograph2)
	(have_image Star6 thermograph2)
	(have_image Planet7 spectrograph1)
	(have_image Planet8 spectrograph1)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 7
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 7
3. (turn_to satellite0 groundstation0 planet3)
   deleted: (pointing satellite0 planet3)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 7
4. (turn_to satellite1 star6 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 star6)
   goals met: 0 of 7
5. (calibrate satellite0 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 0 of 7
6. (turn_to satellite1 planet8 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 planet8)
   goals met: 0 of 7
7. (turn_to satellite0 planet5 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet5)
   goals met: 1 of 7
8. (turn_to satellite1 groundstation0 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 groundstation0)
   goals met: 1 of 7
9. (take_image satellite0 planet5 instrument1 thermograph2)
   added: (have_image planet5 thermograph2)
   goals met: 2 of 7
10. (calibrate satellite1 instrument3 groundstation0)
   added: (calibrated instrument3)
   goals met: 2 of 7
11. (turn_to satellite0 star6 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 star6)
   goals met: 1 of 7
12. (turn_to satellite1 planet8 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 planet8)
   goals met: 1 of 7
13. (take_image satellite0 star6 instrument1 thermograph2)
   added: (have_image star6 thermograph2)
   goals met: 2 of 7
14. (take_image satellite1 planet8 instrument3 spectrograph1)
   added: (have_image planet8 spectrograph1)
   goals met: 3 of 7
15. (turn_to satellite0 planet5 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet5)
   goals met: 4 of 7
16. (turn_to satellite1 planet7 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet7)
   goals met: 4 of 7
17. (take_image satellite1 planet7 instrument3 spectrograph1)
   added: (have_image planet7 spectrograph1)
   goals met: 5 of 7
18. (turn_to satellite0 star4 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 star4)
   goals met: 4 of 7
19. (turn_to satellite1 planet3 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet3)
   goals met: 4 of 7
20. (take_image satellite0 star4 instrument1 spectrograph1)
   added: (have_image star4 spectrograph1)
   goals met: 5 of 7
21. (turn_to satellite0 planet5 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 planet5)
   goals met: 6 of 7
22. (take_image satellite1 planet3 instrument3 spectrograph1)
   added: (have_image planet3 spectrograph1)
   goals met: 7 of 7
